export interface FamilyMember {
  'क्रम संख्या': string | number;
  'मकान नम्बर': string;
  'परिवार के प्रमुख का नाम': string;
  'फैमिली ID': string;
  'राशन कार्ड संख्या': string;
  'राशन कार्ड का प्रकार': string;
  'धर्म': string;
  'जाति': string;
  'सदस्य का नाम': string;
  'पिता / पति का नाम': string;
  'लिंग (पु०/म०)': string;
  'जन्मतिथि': string;
  'उम्र': string | number;
  'आधार कार्ड संख्या': string;
  'दिव्यांगता': string;
  'दिव्यांगता का प्रकार': string;
  'व्यवसाय': string;
  'साक्षर/निरक्षर': string;
  'यदि साक्षर तो शैक्षिक स्तर': string;
  'मोबाइल नंबर': string;
  'सर्किल छोड़ देने या मृत्यु का दिनाँक': string;
  'Timestamp': string;
}

export const emptyMember: FamilyMember = {
  'क्रम संख्या': '',
  'मकान नम्बर': '',
  'परिवार के प्रमुख का नाम': '',
  'फैमिली ID': '',
  'राशन कार्ड संख्या': '',
  'राशन कार्ड का प्रकार': '',
  'धर्म': '',
  'जाति': '',
  'सदस्य का नाम': '',
  'पिता / पति का नाम': '',
  'लिंग (पु०/म०)': '',
  'जन्मतिथि': '',
  'उम्र': '',
  'आधार कार्ड संख्या': '',
  'दिव्यांगता': 'No',
  'दिव्यांगता का प्रकार': '',
  'व्यवसाय': '',
  'साक्षर/निरक्षर': '',
  'यदि साक्षर तो शैक्षिक स्तर': '',
  'मोबाइल नंबर': '',
  'सर्किल छोड़ देने या मृत्यु का दिनाँक': '',
  'Timestamp': ''
};
